tutorials/backwardFacingStep/simpleFoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  4.1                                   | 
|   \  /    A nd           | Web:      www.OpenFOAM.org                      | 
|    \/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 
FoamFile 
{ 
 	 version 	 2.0; 
 	 format 	 ascii; 
 	 class 		 dictionary; 
 	 object 	 blockMeshDict; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

convertToMeters 	1.0; 

vertices 
( 
	 ( 0.0 0.01 0.0 )	// 000
	 ( 1.0 0.01 0.0 )	// 001
	 ( 1.0 0.09 0.0 )	// 002
	 ( 0.0 0.09 0.0 )	// 003
	 ( 0.0 0.01 0.0014 )	// 004
	 ( 1.0 0.01 0.0014 )	// 005
	 ( 1.0 0.09 0.0014 )	// 006
	 ( 0.0 0.09 0.0014 )	// 007
	 ( 1.5 0.01 0.0 )	// 008
	 ( 1.5 0.09 0.0 )	// 009
	 ( 1.5 0.01 0.0014 )	// 010
	 ( 1.5 0.09 0.0014 )	// 011
	 ( 1.0 0.0 0.0 )	// 012
	 ( 1.5 0.0 0.0 )	// 013
	 ( 1.0 0.0 0.0014 )	// 014
	 ( 1.5 0.0 0.0014 )	// 015
); 

edges 
( 
); 

blocks 
( 
	hex
		( 0  1  2  3  4  5  6  7)	( 714  57  1)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 1  8  9  2  5  10  11  6)	( 357  57  1)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 12  13  8  1  14  15  10  5)	( 357  7  1)	simpleGrading 	( 1.0  1.0  1.0)

); 

boundary 
( 
	frontAndBack
	{
		type empty;
		faces
		(
			( 0  1  2  3)
			( 4  5  6  7)
			( 1  8  9  2)
			( 5  10  11  6)
			( 12  13  8  1)
			( 14  15  10  5)
		);
	}

	inlet
	{
		type patch;
		faces
		(
			( 0  3  7  4)
		);
	}

	outlet
	{
		type patch;
		faces
		(
			( 8  9  11  10)
			( 13  8  10  15)
		);
	}

	walls
	{
		type wall;
		faces
		(
			( 3  2  6  7)
			( 0  1  5  4)
			( 2  9  11  6)
			( 12  13  15  14)
			( 12  1  5  14)
		);
	}

); 

mergePatchPairs 
( 
); 

